YCSB-outputs/citus-exec-14-1000000-c-28-rf_3-bs_7000-fs_3000.txt
/usr/local/openjdk-11/bin/java -cp /opt/ycsb/slf4j-api-1.7.30.jar:/opt/ycsb/slf4j-simple-1.7.30.jar:/opt/ycsb/jdbc-binding/lib/postgresql-42.2.14.jar:/opt/ycsb/jdbc-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/jdbc-binding/lib/commons-collections-3.2.1.jar:/opt/ycsb/jdbc-binding/lib/jdbc-binding-0.18.0-SNAPSHOT.jar:/opt/ycsb/jdbc-binding/lib/serp-1.13.1.jar:/opt/ycsb/jdbc-binding/lib/openjpa-lib-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/geronimo-jms_1.1_spec-1.1.1.jar:/opt/ycsb/jdbc-binding/lib/openjpa-kernel-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/geronimo-jta_1.1_spec-1.1.1.jar:/opt/ycsb/jdbc-binding/lib/commons-pool-1.5.4.jar:/opt/ycsb/jdbc-binding/lib/openjpa-jdbc-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/postgresql-42.2.23.jar:/opt/ycsb/jdbc-binding/lib/commons-lang-2.4.jar site.ycsb.Client -db site.ycsb.db.JdbcDBClient -s -P /opt/ycsb/workloads/workloadc -P /opt/ycsb/jdbc-binding/conf/db.properties -p recordcount=1000000 -p operationcount=10000 -t
Command line: -db site.ycsb.db.JdbcDBClient -s -P /opt/ycsb/workloads/workloadc -P /opt/ycsb/jdbc-binding/conf/db.properties -p recordcount=1000000 -p operationcount=10000 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
Adding shard node URL: jdbc:postgresql://10.0.2.5:5432/ycsb
2021-09-19 21:44:56:620 0 sec: 0 operations; est completion in 0 second 
Using shards: 1, batchSize:7000, fetchSize: 3000
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-09-19 21:45:06:568 10 sec: 80 operations; 8 current ops/sec; est completion in 20 minutes [READ: Count=80, Max=453887, Min=48800, Avg=116877.2, 90=198911, 99=269311, 99.9=453887, 99.99=453887] 
2021-09-19 21:45:16:568 20 sec: 199 operations; 11.9 current ops/sec; est completion in 16 minutes [READ: Count=119, Max=197119, Min=48736, Avg=84049.48, 90=104959, 99=189951, 99.9=197119, 99.99=197119] 
2021-09-19 21:45:26:568 30 sec: 313 operations; 11.4 current ops/sec; est completion in 15 minutes [READ: Count=114, Max=194431, Min=48192, Avg=86959.58, 90=116415, 99=189439, 99.9=194431, 99.99=194431] 
2021-09-19 21:45:36:568 40 sec: 430 operations; 11.7 current ops/sec; est completion in 14 minutes [READ: Count=117, Max=189951, Min=47936, Avg=84918.02, 90=111807, 99=166143, 99.9=189951, 99.99=189951] 
2021-09-19 21:45:46:568 50 sec: 539 operations; 10.9 current ops/sec; est completion in 14 minutes [READ: Count=109, Max=200959, Min=47776, Avg=91264.44, 90=143743, 99=180351, 99.9=200959, 99.99=200959] 
2021-09-19 21:45:56:568 60 sec: 646 operations; 10.7 current ops/sec; est completion in 14 minutes [READ: Count=107, Max=212479, Min=49184, Avg=94260.04, 90=144127, 99=191615, 99.9=212479, 99.99=212479] 
2021-09-19 21:46:06:568 70 sec: 762 operations; 11.6 current ops/sec; est completion in 14 minutes [READ: Count=116, Max=204287, Min=47488, Avg=86395.72, 90=118847, 99=201471, 99.9=204287, 99.99=204287] 
2021-09-19 21:46:16:568 80 sec: 878 operations; 11.6 current ops/sec; est completion in 13 minutes [READ: Count=116, Max=205439, Min=47776, Avg=85917.1, 90=109695, 99=205183, 99.9=205439, 99.99=205439] 
2021-09-19 21:46:26:568 90 sec: 990 operations; 11.2 current ops/sec; est completion in 13 minutes [READ: Count=112, Max=207487, Min=47808, Avg=89643.57, 90=124799, 99=200959, 99.9=207487, 99.99=207487] 
2021-09-19 21:46:36:568 100 sec: 1110 operations; 12 current ops/sec; est completion in 13 minutes [READ: Count=120, Max=195967, Min=47648, Avg=83141.87, 90=110719, 99=195071, 99.9=195967, 99.99=195967] 
2021-09-19 21:46:46:568 110 sec: 1218 operations; 10.8 current ops/sec; est completion in 13 minutes [READ: Count=108, Max=202239, Min=47552, Avg=92499.85, 90=135039, 99=195199, 99.9=202239, 99.99=202239] 
2021-09-19 21:46:56:568 120 sec: 1328 operations; 11 current ops/sec; est completion in 13 minutes [READ: Count=110, Max=192639, Min=49024, Avg=90191.56, 90=139391, 99=187007, 99.9=192639, 99.99=192639] 
2021-09-19 21:47:06:568 130 sec: 1440 operations; 11.2 current ops/sec; est completion in 12 minutes [READ: Count=112, Max=189055, Min=47328, Avg=89235.29, 90=144511, 99=188799, 99.9=189055, 99.99=189055] 
2021-09-19 21:47:16:568 140 sec: 1550 operations; 11 current ops/sec; est completion in 12 minutes [READ: Count=110, Max=185983, Min=49088, Avg=91349.24, 90=143231, 99=182143, 99.9=185983, 99.99=185983] 
2021-09-19 21:47:26:568 150 sec: 1666 operations; 11.6 current ops/sec; est completion in 12 minutes [READ: Count=116, Max=176639, Min=47424, Avg=86504, 90=121407, 99=174847, 99.9=176639, 99.99=176639] 
2021-09-19 21:47:36:568 160 sec: 1783 operations; 11.7 current ops/sec; est completion in 12 minutes [READ: Count=117, Max=185727, Min=47488, Avg=85339.08, 90=113663, 99=177791, 99.9=185727, 99.99=185727] 
2021-09-19 21:47:46:568 170 sec: 1899 operations; 11.6 current ops/sec; est completion in 12 minutes [READ: Count=116, Max=185727, Min=49312, Avg=86080, 90=126079, 99=184191, 99.9=185727, 99.99=185727] 
2021-09-19 21:47:56:568 180 sec: 2021 operations; 12.2 current ops/sec; est completion in 11 minutes [READ: Count=122, Max=169983, Min=48160, Avg=81952.26, 90=98879, 99=169471, 99.9=169983, 99.99=169983] 
2021-09-19 21:48:06:568 190 sec: 2139 operations; 11.8 current ops/sec; est completion in 11 minutes [READ: Count=118, Max=200831, Min=47936, Avg=84725.02, 90=111487, 99=190463, 99.9=200831, 99.99=200831] 
2021-09-19 21:48:16:568 200 sec: 2252 operations; 11.3 current ops/sec; est completion in 11 minutes [READ: Count=113, Max=209151, Min=48160, Avg=88219.61, 90=129087, 99=179199, 99.9=209151, 99.99=209151] 
2021-09-19 21:48:26:568 210 sec: 2371 operations; 11.9 current ops/sec; est completion in 11 minutes [READ: Count=119, Max=216191, Min=48128, Avg=84119.8, 90=117631, 99=177407, 99.9=216191, 99.99=216191] 
2021-09-19 21:48:36:568 220 sec: 2486 operations; 11.5 current ops/sec; est completion in 11 minutes [READ: Count=115, Max=179583, Min=48896, Avg=87094.4, 90=118911, 99=173311, 99.9=179583, 99.99=179583] 
2021-09-19 21:48:46:568 230 sec: 2601 operations; 11.5 current ops/sec; est completion in 10 minutes [READ: Count=115, Max=203775, Min=47744, Avg=86497.25, 90=119295, 99=203007, 99.9=203775, 99.99=203775] 
2021-09-19 21:48:56:568 240 sec: 2716 operations; 11.5 current ops/sec; est completion in 10 minutes [READ: Count=115, Max=205567, Min=47616, Avg=87142.82, 90=124031, 99=184703, 99.9=205567, 99.99=205567] 
2021-09-19 21:49:06:568 250 sec: 2832 operations; 11.6 current ops/sec; est completion in 10 minutes [READ: Count=116, Max=195583, Min=47808, Avg=85657.38, 90=99903, 99=181119, 99.9=195583, 99.99=195583] 
2021-09-19 21:49:16:568 260 sec: 2948 operations; 11.6 current ops/sec; est completion in 10 minutes [READ: Count=116, Max=200447, Min=48768, Avg=86495.45, 90=125055, 99=182655, 99.9=200447, 99.99=200447] 
2021-09-19 21:49:26:568 270 sec: 3068 operations; 12 current ops/sec; est completion in 10 minutes [READ: Count=120, Max=206975, Min=47488, Avg=83223.47, 90=118079, 99=195071, 99.9=206975, 99.99=206975] 
2021-09-19 21:49:36:568 280 sec: 3178 operations; 11 current ops/sec; est completion in 10 minutes [READ: Count=110, Max=205183, Min=48480, Avg=91027.05, 90=149375, 99=202111, 99.9=205183, 99.99=205183] 
2021-09-19 21:49:46:568 290 sec: 3293 operations; 11.5 current ops/sec; est completion in 9 minutes [READ: Count=115, Max=207871, Min=48064, Avg=86811.69, 90=125439, 99=206719, 99.9=207871, 99.99=207871] 
2021-09-19 21:49:56:568 300 sec: 3408 operations; 11.5 current ops/sec; est completion in 9 minutes [READ: Count=115, Max=204415, Min=47392, Avg=85755.27, 90=117567, 99=203391, 99.9=204415, 99.99=204415] 
2021-09-19 21:50:06:568 310 sec: 3517 operations; 10.9 current ops/sec; est completion in 9 minutes [READ: Count=109, Max=208511, Min=47264, Avg=92950.61, 90=171007, 99=203647, 99.9=208511, 99.99=208511] 
2021-09-19 21:50:16:568 320 sec: 3635 operations; 11.8 current ops/sec; est completion in 9 minutes [READ: Count=118, Max=199807, Min=48064, Avg=84370.44, 90=117311, 99=183167, 99.9=199807, 99.99=199807] 
2021-09-19 21:50:26:568 330 sec: 3747 operations; 11.2 current ops/sec; est completion in 9 minutes [READ: Count=112, Max=201599, Min=49088, Avg=89484.14, 90=133759, 99=197887, 99.9=201599, 99.99=201599] 
2021-09-19 21:50:36:568 340 sec: 3858 operations; 11.1 current ops/sec; est completion in 9 minutes [READ: Count=111, Max=205055, Min=49312, Avg=88879.86, 90=123839, 99=204543, 99.9=205055, 99.99=205055] 
2021-09-19 21:50:46:568 350 sec: 3973 operations; 11.5 current ops/sec; est completion in 8 minutes [READ: Count=115, Max=219135, Min=48192, Avg=87614.05, 90=140927, 99=202623, 99.9=219135, 99.99=219135] 
2021-09-19 21:50:56:568 360 sec: 4087 operations; 11.4 current ops/sec; est completion in 8 minutes [READ: Count=114, Max=204031, Min=47520, Avg=87723.65, 90=131583, 99=199295, 99.9=204031, 99.99=204031] 
2021-09-19 21:51:06:568 370 sec: 4200 operations; 11.3 current ops/sec; est completion in 8 minutes [READ: Count=113, Max=216191, Min=47040, Avg=88315.47, 90=100671, 99=205183, 99.9=216191, 99.99=216191] 
2021-09-19 21:51:16:568 380 sec: 4319 operations; 11.9 current ops/sec; est completion in 8 minutes [READ: Count=119, Max=209663, Min=47456, Avg=84570.08, 90=96127, 99=207231, 99.9=209663, 99.99=209663] 
2021-09-19 21:51:26:568 390 sec: 4432 operations; 11.3 current ops/sec; est completion in 8 minutes [READ: Count=113, Max=218879, Min=47968, Avg=88212.96, 90=116031, 99=205311, 99.9=218879, 99.99=218879] 
2021-09-19 21:51:36:568 400 sec: 4539 operations; 10.7 current ops/sec; est completion in 8 minutes [READ: Count=107, Max=210815, Min=47680, Avg=93523.74, 90=138495, 99=206463, 99.9=210815, 99.99=210815] 
2021-09-19 21:51:46:568 410 sec: 4649 operations; 11 current ops/sec; est completion in 7 minutes [READ: Count=110, Max=207743, Min=48736, Avg=90997.09, 90=143743, 99=206335, 99.9=207743, 99.99=207743] 
2021-09-19 21:51:56:568 420 sec: 4769 operations; 12 current ops/sec; est completion in 7 minutes [READ: Count=120, Max=193023, Min=48768, Avg=83283.73, 90=99519, 99=185599, 99.9=193023, 99.99=193023] 
2021-09-19 21:52:06:568 430 sec: 4881 operations; 11.2 current ops/sec; est completion in 7 minutes [READ: Count=112, Max=210943, Min=49024, Avg=88827.86, 90=137471, 99=210559, 99.9=210943, 99.99=210943] 
2021-09-19 21:52:16:568 440 sec: 5000 operations; 11.9 current ops/sec; est completion in 7 minutes [READ: Count=119, Max=213887, Min=47520, Avg=83850.62, 90=104383, 99=185599, 99.9=213887, 99.99=213887] 
2021-09-19 21:52:26:568 450 sec: 5109 operations; 10.9 current ops/sec; est completion in 7 minutes [READ: Count=109, Max=205311, Min=48832, Avg=91739.01, 90=145151, 99=203391, 99.9=205311, 99.99=205311] 
2021-09-19 21:52:36:568 460 sec: 5220 operations; 11.1 current ops/sec; est completion in 7 minutes [READ: Count=111, Max=206591, Min=47392, Avg=90322.45, 90=163199, 99=202623, 99.9=206591, 99.99=206591] 
2021-09-19 21:52:46:568 470 sec: 5325 operations; 10.5 current ops/sec; est completion in 6 minutes [READ: Count=105, Max=204927, Min=47520, Avg=95131.43, 90=161023, 99=198527, 99.9=204927, 99.99=204927] 
2021-09-19 21:52:56:568 480 sec: 5439 operations; 11.4 current ops/sec; est completion in 6 minutes [READ: Count=114, Max=209023, Min=47776, Avg=87734.32, 90=125951, 99=206591, 99.9=209023, 99.99=209023] 
2021-09-19 21:53:06:568 490 sec: 5555 operations; 11.6 current ops/sec; est completion in 6 minutes [READ: Count=116, Max=210047, Min=47520, Avg=85758.34, 90=129535, 99=208639, 99.9=210047, 99.99=210047] 
2021-09-19 21:53:16:568 500 sec: 5666 operations; 11.1 current ops/sec; est completion in 6 minutes [READ: Count=111, Max=212479, Min=47552, Avg=90262.05, 90=136703, 99=206335, 99.9=212479, 99.99=212479] 
2021-09-19 21:53:26:568 510 sec: 5774 operations; 10.8 current ops/sec; est completion in 6 minutes [READ: Count=108, Max=207999, Min=47520, Avg=92731.7, 90=131007, 99=202367, 99.9=207999, 99.99=207999] 
2021-09-19 21:53:36:568 520 sec: 5890 operations; 11.6 current ops/sec; est completion in 6 minutes [READ: Count=116, Max=199423, Min=47360, Avg=86141.38, 90=119487, 99=199167, 99.9=199423, 99.99=199423] 
2021-09-19 21:53:46:568 530 sec: 6006 operations; 11.6 current ops/sec; est completion in 5 minutes [READ: Count=116, Max=183935, Min=47424, Avg=85118.07, 90=116479, 99=183807, 99.9=183935, 99.99=183935] 
2021-09-19 21:53:56:568 540 sec: 6125 operations; 11.9 current ops/sec; est completion in 5 minutes [READ: Count=119, Max=203263, Min=47936, Avg=85192.47, 90=113279, 99=198527, 99.9=203263, 99.99=203263] 
2021-09-19 21:54:06:568 550 sec: 6237 operations; 11.2 current ops/sec; est completion in 5 minutes [READ: Count=112, Max=215423, Min=48896, Avg=89266.71, 90=144127, 99=205695, 99.9=215423, 99.99=215423] 
2021-09-19 21:54:16:568 560 sec: 6355 operations; 11.8 current ops/sec; est completion in 5 minutes [READ: Count=118, Max=190847, Min=47456, Avg=84414.1, 90=120767, 99=189055, 99.9=190847, 99.99=190847] 
2021-09-19 21:54:26:568 570 sec: 6464 operations; 10.9 current ops/sec; est completion in 5 minutes [READ: Count=109, Max=201855, Min=48768, Avg=91393.03, 90=131199, 99=200447, 99.9=201855, 99.99=201855] 
2021-09-19 21:54:36:568 580 sec: 6580 operations; 11.6 current ops/sec; est completion in 5 minutes [READ: Count=116, Max=201471, Min=47968, Avg=86947.31, 90=120447, 99=199167, 99.9=201471, 99.99=201471] 
2021-09-19 21:54:46:568 590 sec: 6686 operations; 10.6 current ops/sec; est completion in 4 minutes [READ: Count=106, Max=206591, Min=47840, Avg=93877.89, 90=128319, 99=200703, 99.9=206591, 99.99=206591] 
2021-09-19 21:54:56:568 600 sec: 6813 operations; 12.7 current ops/sec; est completion in 4 minutes [READ: Count=127, Max=187135, Min=47552, Avg=79105.39, 90=97023, 99=158207, 99.9=187135, 99.99=187135] 
2021-09-19 21:55:06:568 610 sec: 6931 operations; 11.8 current ops/sec; est completion in 4 minutes [READ: Count=118, Max=202623, Min=47744, Avg=84427.8, 90=103231, 99=187007, 99.9=202623, 99.99=202623] 
2021-09-19 21:55:16:568 620 sec: 7043 operations; 11.2 current ops/sec; est completion in 4 minutes [READ: Count=112, Max=203391, Min=47616, Avg=89247.86, 90=128255, 99=200447, 99.9=203391, 99.99=203391] 
2021-09-19 21:55:26:568 630 sec: 7155 operations; 11.2 current ops/sec; est completion in 4 minutes [READ: Count=112, Max=208383, Min=47392, Avg=89476.86, 90=130623, 99=191231, 99.9=208383, 99.99=208383] 
2021-09-19 21:55:36:568 640 sec: 7266 operations; 11.1 current ops/sec; est completion in 4 minutes [READ: Count=111, Max=183167, Min=47456, Avg=90058.09, 90=120767, 99=182015, 99.9=183167, 99.99=183167] 
2021-09-19 21:55:46:568 650 sec: 7379 operations; 11.3 current ops/sec; est completion in 3 minutes [READ: Count=113, Max=204287, Min=47520, Avg=88390.09, 90=153855, 99=180863, 99.9=204287, 99.99=204287] 
2021-09-19 21:55:56:568 660 sec: 7493 operations; 11.4 current ops/sec; est completion in 3 minutes [READ: Count=114, Max=201343, Min=47776, Avg=87240.28, 90=132607, 99=200959, 99.9=201343, 99.99=201343] 
2021-09-19 21:56:06:568 670 sec: 7604 operations; 11.1 current ops/sec; est completion in 3 minutes [READ: Count=111, Max=208639, Min=47264, Avg=90249.95, 90=147327, 99=200575, 99.9=208639, 99.99=208639] 
2021-09-19 21:56:16:568 680 sec: 7716 operations; 11.2 current ops/sec; est completion in 3 minutes [READ: Count=112, Max=204799, Min=48928, Avg=89503.57, 90=112319, 99=204671, 99.9=204799, 99.99=204799] 
2021-09-19 21:56:26:568 690 sec: 7826 operations; 11 current ops/sec; est completion in 3 minutes [READ: Count=110, Max=202495, Min=47584, Avg=90974.25, 90=161663, 99=202367, 99.9=202495, 99.99=202495] 
2021-09-19 21:56:36:568 700 sec: 7939 operations; 11.3 current ops/sec; est completion in 3 minutes [READ: Count=113, Max=187775, Min=48096, Avg=87729.7, 90=131327, 99=187519, 99.9=187775, 99.99=187775] 
2021-09-19 21:56:46:568 710 sec: 8051 operations; 11.2 current ops/sec; est completion in 2 minutes [READ: Count=112, Max=212223, Min=49120, Avg=89690.86, 90=138623, 99=210687, 99.9=212223, 99.99=212223] 
2021-09-19 21:56:56:568 720 sec: 8170 operations; 11.9 current ops/sec; est completion in 2 minutes [READ: Count=119, Max=190463, Min=47296, Avg=83810.82, 90=115775, 99=188543, 99.9=190463, 99.99=190463] 
2021-09-19 21:57:06:568 730 sec: 8280 operations; 11 current ops/sec; est completion in 2 minutes [READ: Count=110, Max=214527, Min=49056, Avg=91530.62, 90=135935, 99=208255, 99.9=214527, 99.99=214527] 
2021-09-19 21:57:16:568 740 sec: 8400 operations; 12 current ops/sec; est completion in 2 minutes [READ: Count=120, Max=206207, Min=47616, Avg=83084.13, 90=101183, 99=199679, 99.9=206207, 99.99=206207] 
2021-09-19 21:57:26:567 750 sec: 8521 operations; 12.1 current ops/sec; est completion in 2 minutes [READ: Count=121, Max=181375, Min=47552, Avg=82052.36, 90=113855, 99=177919, 99.9=181375, 99.99=181375] 
2021-09-19 21:57:36:568 760 sec: 8641 operations; 12 current ops/sec; est completion in 2 minutes [READ: Count=120, Max=204159, Min=47328, Avg=83618.53, 90=112575, 99=183295, 99.9=204159, 99.99=204159] 
2021-09-19 21:57:46:568 770 sec: 8743 operations; 10.2 current ops/sec; est completion in 1 minute [READ: Count=102, Max=221311, Min=47552, Avg=97898.98, 90=179327, 99=210815, 99.9=221311, 99.99=221311] 
2021-09-19 21:57:56:568 780 sec: 8855 operations; 11.2 current ops/sec; est completion in 1 minute [READ: Count=112, Max=223615, Min=47328, Avg=89620.86, 90=147839, 99=207487, 99.9=223615, 99.99=223615] 
2021-09-19 21:58:06:568 790 sec: 8971 operations; 11.6 current ops/sec; est completion in 1 minute [READ: Count=116, Max=179967, Min=47072, Avg=85845.93, 90=97407, 99=178175, 99.9=179967, 99.99=179967] 
2021-09-19 21:58:16:568 800 sec: 9088 operations; 11.7 current ops/sec; est completion in 1 minute [READ: Count=117, Max=201727, Min=47392, Avg=86019.28, 90=126079, 99=196351, 99.9=201727, 99.99=201727] 
2021-09-19 21:58:26:568 810 sec: 9202 operations; 11.4 current ops/sec; est completion in 1 minute [READ: Count=114, Max=199935, Min=49120, Avg=87168.98, 90=106879, 99=196863, 99.9=199935, 99.99=199935] 
2021-09-19 21:58:36:568 820 sec: 9309 operations; 10.7 current ops/sec; est completion in 1 minute [READ: Count=107, Max=205311, Min=47328, Avg=93699.29, 90=145791, 99=201215, 99.9=205311, 99.99=205311] 
2021-09-19 21:58:46:568 830 sec: 9429 operations; 12 current ops/sec; est completion in 51 seconds [READ: Count=120, Max=204159, Min=47200, Avg=83230.13, 90=110399, 99=200959, 99.9=204159, 99.99=204159] 
2021-09-19 21:58:56:568 840 sec: 9545 operations; 11.6 current ops/sec; est completion in 41 seconds [READ: Count=116, Max=207231, Min=47360, Avg=86071.86, 90=121727, 99=202623, 99.9=207231, 99.99=207231] 
2021-09-19 21:59:06:568 850 sec: 9666 operations; 12.1 current ops/sec; est completion in 30 seconds [READ: Count=121, Max=205311, Min=47072, Avg=82785.72, 90=103039, 99=178943, 99.9=205311, 99.99=205311] 
2021-09-19 21:59:16:568 860 sec: 9782 operations; 11.6 current ops/sec; est completion in 20 seconds [READ: Count=116, Max=203775, Min=49184, Avg=86480.28, 90=114879, 99=178431, 99.9=203775, 99.99=203775] 
2021-09-19 21:59:26:568 870 sec: 9900 operations; 11.8 current ops/sec; est completion in 9 second [READ: Count=118, Max=201471, Min=46976, Avg=84753.08, 90=100607, 99=200703, 99.9=201471, 99.99=201471] 
2021-09-19 21:59:35:758 879 sec: 10000 operations; 10.88 current ops/sec; [READ: Count=100, Max=201215, Min=47008, Avg=91564.32, 90=140415, 99=195967, 99.9=201215, 99.99=201215] [CLEANUP: Count=1, Max=38783, Min=38752, Avg=38768, 90=38783, 99=38783, 99.9=38783, 99.99=38783] 
[OVERALL], RunTime(ms), 879191
[OVERALL], Throughput(ops/sec), 11.37409277392512
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 42
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.00477711896504855
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 42
[TOTAL_GC_TIME_%], Time(%), 0.00477711896504855
[READ], Operations, 10000
[READ], AverageLatency(us), 87805.752
[READ], MinLatency(us), 46976
[READ], MaxLatency(us), 453887
[READ], 95thPercentileLatency(us), 168959
[READ], 99thPercentileLatency(us), 201471
[READ], Return=OK, 10000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 38768.0
[CLEANUP], MinLatency(us), 38752
[CLEANUP], MaxLatency(us), 38783
[CLEANUP], 95thPercentileLatency(us), 38783
[CLEANUP], 99thPercentileLatency(us), 38783